QUESTION 1

.head()

.read_csv

.loc[:]

.describe()

.fillna()

In [6]:
import pandas as pd

QUESTION 2

In [7]:
columns=['col_A','col_B','col_C']
index=[0,1,2]
df=pd.DataFrame(columns=columns,index=index)
df

  col_A col_B col_C
0   NaN   NaN   NaN
1   NaN   NaN   NaN
2   NaN   NaN   NaN

In [9]:
new_index=[1,3,5]
df.reindex(new_index)

  col_A col_B col_C
1   NaN   NaN   NaN
3   NaN   NaN   NaN
5   NaN   NaN   NaN

QUESTION 3

In [51]:
data={'values':[10, 20, 30, 40, 50]}
df1=pd.DataFrame(data)
df1

   values
0      10
1      20
2      30
3      40
4      50

In [54]:
print(df1['values'].loc[0:2].sum())

60

QUESTION 4

In [39]:
d={'text':['sudhanshu kumar','krish nair','pwskills']}
df2=pd.DataFrame(d)
df2

              text
0  sudhanshu kumar
1       krish nair
2         pwskills

In [40]:
df2['word_count']=df2['text'].apply(lambda x : len(x.split(' ')))
df2

              text  word_count
0  sudhanshu kumar           2
1       krish nair           2
2         pwskills           1

QUESTION 5

## df.shape
1.df.shape gives (no.of rows,no.of columns ).

2.Return a tuple representing the dimensionality of the DataFrame.


## df.size
1.Return an int representing the number of elements in this object.

In [48]:
df1.shape

(5, 1)

In [50]:
df1.size

5

QUESTION 6

We can use the pandas module read_excel() function to read the excel file data into a DataFrame object.

QUESTION 7

In [55]:
d1={'email':['johndoe@gmail.com','sudhkumar@gmail.com','chauhansamad@gmail.com']}
df3=pd.DataFrame(d1)
df3

                    email
0       johndoe@gmail.com
1     sudhkumar@gmail.com
2  chauhansamad@gmail.com

In [67]:
df3['username']=df3['email'].apply(lambda x : x.split('@')[0])
df3

                    email      username
0       johndoe@gmail.com       johndoe
1     sudhkumar@gmail.com     sudhkumar
2  chauhansamad@gmail.com  chauhansamad

QUESTION 8

In [70]:
d3={'A':[3,8,6,2,9],
    'B':[5,2,9,3,1],
    'C':[1,7,5,4,2]}
df4=pd.DataFrame(d3)
df4

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  5
3  2  3  4
4  9  1  2

In [81]:
df5=df4[(df4['A']>5 ) & (df4['B']<10)]
df5

   A  B  C
1  8  2  7
2  6  9  5
4  9  1  2